[M_Sage_Mission01 MissionDefinition]
MissionDescription="Sir Hammerlock invites you to Agros Swamp for a week of exploration, hunting and friendship. finished Time to find the hammer!."

[M_Sage_Mission01:ClearLodgeSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sir Hammerlock invites you to the land of the Marshes for a weekend of exploring, hunting and friendship..<br><br>Go into the inn and see how they run the bars. Help them before the hunt begins.."

[M_Sage_Mission01:DefendSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Have a hammer handy when repairing your ship.."
MissionDescriptionOverride="Lord Hammerlock invites you to the swampy continent of Egrus for a weekend of exploration, hunting, and friendship..<br><br>They meet Hammerlock at the edge of the swamp. However, Hamerlok believes that the best angle is in the middle of the exit, and suggests taking a boat of lovers to the mud in the middle of the swamp..<br><br>Unfortunately, the nearby boat anchor is broken and you have to work if you want to go deeper into the swamp. During construction, you must protect the hammer lock."
